 {
     "301": {
         "id": 301,
         "title": "Credenciamento",
         "description": "Este é o momendo de fazer o seu checkin e fazer a sua doação do 1kg de alimento não perecível.",
         "image": "/images/backgrounds/opening-jvn.jpg"
     },
     "302": {
         "id": 302,
         "title": "Abertura Javaneiros 2017",
         "description": "Abertura oficial da nona edição do Javaneiros. Agradecimento aos organizadores, patrocinadores e apoiadores.",
         "image": "/images/backgrounds/registration-jvn.jpg"
     },
     "303": {
         "id": 303,
         "title": "Novidades sobre JavaSE 9 e tendências de mercado que podem influenciar o novo JavaEE 8",
         "description": "Nesta sessão vamos passar por algumas novidades muito importantes do JavaSE 9, tais como o projeto de mobularidade conhecido como Jigsaw. E, discutiremos sobre algumas tendências de mercado tais como Cloud, microserviços e containers e seus desdobramentos que podem vir a influenciar a nova versão do JavaEE.",
         "speakers": [
             103
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "304": {
         "id": 304,
         "title": "Oportunidades para pessoas desenvolvedoras de 2017",
         "description": "",
         "speakers": [
             101
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "305": {
         "id": 305,
         "title": "Java EE 8: As Novidades no Release Java EE 8",
         "description": "Nesta sessão vamos apresentar um visão do release recente da plataforma Java EE 8. Tópicos cobertos incluem a nova API JSON Binding, atualizações da API de Processamento JSON, o JAX-RS reactive client API, suporte JAX-RS para server-sent events, suporte HTTP/2 no Servlet, a nova Java EE Security API, e as novas capacidades em Bean Validation e CDI.",
         "speakers": [
             102
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "306": {
         "id": 306,
         "title": "O que devo procurar em um Code Review?",
         "description": "Irei falar um pouco da minha atual experiência na Concrete, no time de operações. Como mensurar a efetividade dos testes, o uso code styles, implementação de padrões e anti-paterns de um Merge Request(MR), e vários outros fatores que podem indicar o aceite ou não do MR.",
         "speakers": [
             202
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "307": {
         "id": 307,
         "title": "Kotlin for Web, primeiros passos com Servlets",
         "description": "Kotlin é a nova linguagem que promete competir com o mercado Java, nesta palestra serão apresentados as características principal do Kotlin e uma demo de uma aplicação web rodando uma Servlet.",
         "speakers": [
             203
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "308": {
         "id": 308,
         "title": "Interação do marketing digital com IT",
         "description": "Dificilmente os profissionais de desesnvolvimento e análise de sistemas incluem as experiencias digitais com os sistemas desenvolvidos. Um bom sistema não é nada sem ter uma boa interação com seu publico alvo. A palestra consiste em uma apresntação sobre o marketing digital e o que pode ser pensado para o futuro do desenvolvimento de softwares voltados para o MKT D.",
         "speakers": [
             204
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "309": {
         "id": 309,
         "title": "Um mundo novo para quem não conhece ASP.NET Core",
         "description": "Recentemente a Microsoft lançou o ASP.NET Core, uma plataforma cross-platform e com código aberto. Nesta palestra vamos ver as principais mudanças, conceitos, performance e um app funcionando no Linux e nativamente com .Net Core e SQL Server",
         "speakers": [
             205
         ],
         "complexity": "Iniciantes",
         "tags": [
            "Desenvolvimento",
            "ASP.NET"
         ]
     },
     "310": {
         "id": 310,
         "title": "Além do EC2: Implementando Arquiteturas Escaláveis na Amazon AWS",
         "description": "Tiago vai falar de Lambda, Api Gateway e Elastic Search. Patrick sobre ELB, Cloud Formation, Auto Scaling, Cloud Watch e como a gente faz pra simular a infra aqui no Docker pro desenvolvedor local.",
         "speakers": [
             218,219
         ],
         "complexity": "Praticantes",
         "tags": [
            "Desenvolvimento",
            "AWS"
         ]
     },
    "311": {
         "id": 311,
         "title": "IBM Watson Conversation - Inteligência artificial para chatbots",
         "description": "Abordar as ferramentas para construção  de  chatbots no facebook messenger utilizando IBM Watson Conversation, Node-Red, ChatFuel entre outras plataformas.",
         "speakers": [
             207
         ],
         "complexity": "Iniciantes",
         "tags": [
            "Desenvolvimento",
            "Chatbots"
         ]
     },
    "312": {
         "id": 312,
         "title": "Cuspindo Back-end com Firebase",
         "description": "Como usar todo o poder do Firebase para criar aplicações Serverless e Realtime no seu horario de almoço",
         "speakers": [
             208
         ],
         "complexity": "Praticantes",
         "tags": [
            "Firebase",
            "Desenvolvimento"
         ]
     },
    "313": {
         "id": 313,
         "title": "Gerenciamento de container docker com kubernetes",
         "description": "Nesta palestra vamos aprender como gerenciar container docker local ou na nuvem usando kubernetes + minikube + gcloud / aws / azure. Sobre a arquitetura do kubernetes iremos falar de: Namespaces, Nodes, Deployments, Services, PersistVolume, ConfigMap, Replication controller. Como demonstração iremos montar um cluster de tomcat 8 e um Serviço de Database usando MySQL com o recurso de PersistVolume e ainda vamos usar o Nginx com o recurso de ConfigMap.",
         "speakers": [
             209
         ],
         "complexity": "Iniciantes",
         "tags": [
            "Desenvolvimento",
            "Docker"
         ]
     },
    "314": {
         "id": 314,
         "title": "PWA, Service Worker e Offline first - WTF?",
         "description": "Nesta palestra, pretendo abordar de forma superficial (e muito provavelmente com pouco código) o que é PWA (Progressive Web App), como é o funcionamento de um web service e a importância do PWA atualmente, comparando-o com um app nativo em vários aspectos. Para acompanhar a palestra, a pessoa precisa ter um conhecimento básico sobre Javascript e sobre web apps (que será também abordado e explicado na palestra). Serão exibidos exemplos de PWA, o que é possível de ser realizado e o que não é, testes de performances e uma ou duas prints (sem live code) do código de um PWA básico.",
         "speakers": [
             210
         ],
         "complexity": "Praticantes",
         "tags": [
            "Desenvolvimento",
            "PWA"
         ]
     },
    "315": {
         "id": 315,
         "title": "Utilizando bibliotecas de acesso a webservices com Android",
         "description": "A palestra demonstrará como utilizar bibliotecas em Android que permitam o acesso a webservices para enviar e receber dados.",
         "speakers": [
             211
         ],
         "complexity": "Praticantes",
         "tags": [
            "Android",
            "Desenvolvimento"
         ]
     },
    "316": {
         "id": 316,
         "title": "Não seja Desenvolvedor de software! Seja desenvolvedor de idéias",
         "description": "Essa palestra tem o intuito de abrir a cabeça para mostrar alguns pontos que são importantes para desenvolver uma ideia, e não somente um software sem utilidade. Assim gerando mais produtividade pessoal e um MVP enxuto sem perder a qualidade do seu software. E algumas dicas para começar a pensar com desenvolvedor de ideias e não somente um desenvolvedor de software.",
         "speakers": [
             212
         ],
         "complexity": "Iniciantes",
         "tags": [
            "Desenvolvimento"
         ]
     },
    "317": {
         "id": 317,
         "title": "Devs iOS onde vivem? O que comem? Como se reproduzem? Hoje no Javaneiros",
         "description": "Falar um pouco sobre essa área que nunca ganhou muita visibilidade em CG, como as pessoas podem ingressar nela, o que é preciso, como é o mercado e etc...",
         "speakers": [
             213
         ],
         "complexity": "Iniciantes",
         "tags": [
            "Desenvolvimento",
            "iOS"
         ]
     },
        "318": {
         "id": 318,
         "title": "O papel do Gestor de Produtos no Desenv. de Software",
         "description": "Neste mundo de Startups e MVPs, a cada dia nascem inúmeras empresas tentando emplacar um novo produto. Porém, muitas fracassam. A falta de Gestores de Produto é uma das causas deste fracasso. Neste bate-papo apresentarei os conceitos básicos de Gestão de Produtos de Software e os motivos deste papel ser tão importante para aumentar as chances do seu produto dar certo.",
         "speakers": [
             214
         ],
         "complexity": "Profissionais",
         "tags": [
            "Desenvolvimento",
            "Gestão de Produtos"
         ]
     },
     "319": {
         "id": 319,
         "title": "Blockchain o que codar nesse bicho.",
         "description": "Blockchain todo mundo está interessado, mas nele não tem só cripto moedas temos serviços que podem ser explorados e que talvez possa ser o próximo paypal. O intuito da palestra é explicar como podemos utilizar o blockchain para desenvolver soluções!",
         "speakers": [
             215
         ],
         "complexity": "Praticantes",
         "tags": [
            "Desenvolvimento",
            "Blockchain"
         ]
     },
     "320": {
         "id": 320,
         "title": "MVP - o núcleo do seu produto",
         "description": "O que é MVP e como ele pode ser facilitado utilizando o framework Ruby on Rails para se gerar um protótipo rápido.",
         "speakers": [
             216, 217
         ],
         "complexity": "Praticantes",
         "tags": [
            "Desenvolvimento",
                "RubyOnRails"
         ]
     },
     "321": {
         "id": 321,
         "title": "Almoço",
         "description": "Comidaaaaa!",
         "image": "/images/backgrounds/lunch.jpg"
     },
     "322": {
         "id": 322,
         "title": "Encerramento",
         "description": "Encerramento, agradecimentos e sorteio de vários brindes incríveis.",
         "image": "/images/backgrounds/closing-jvn.png"
     },
     "323": {
         "id": 323,
         "title": "Pós evento e Networking",
         "description": "Hora de fazer aquele networking...",
         "image": "/images/backgrounds/party.jpg"
     },
     "324": {
         "id": 324,
         "title": "Coffee-break",
         "description": "Hora de matar a fome! A organização do javaneiros desafia vocês a comerem toda a comida.",
         "image": "/images/backgrounds/coffee-break.jpg"
     },
     "325": {
         "id": 325,
         "title": "Keynote de Encerramento",
         "description": "Palestra de encerramento com o Java man.",
         "speakers": [
             104
         ],
         "complexity": "Praticantes",
         "tags": [
            "Desenvolvimento"
         ]
     },
     "326": {
         "id": 326,
         "title": "Microsserviços com JBoss Swarm e Openshift",
         "description": "Microsserviços com JBoss Swarm e Openshift com Elvis Rocha",
         "speakers": [
             103
         ],
         "complexity": "Praticantes",
         "tags": [
            "Desenvolvimento"
         ]
     }
 }