 {
     "301": {
         "id": 301,
         "title": "Credenciamento",
         "description": "Este é o momendo de fazer o seu checkin e fazer a sua doação do 1kg de alimento não perecível.",
         "image": "/images/backgrounds/opening-jvn.jpg"
     },
     "302": {
         "id": 302,
         "title": "Abertura Javaneiros 2016",
         "description": "Abertura oficial da nona edição do javaneiros. Agradecimento aos organizadores, patrocinadores e apoiadores.",
         "image": "/images/backgrounds/registration-jvn.jpg"
     },
     "303": {
         "id": 303,
         "title": "Keynote Oracle - JavaEE 8",
         "description": "",
         "speakers": [
             103
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "304": {
         "id": 304,
         "title": "Android Clean Architecture",
         "description": "Vamos conversar sobre clean architecture, suas vantagens, porque você deveria se preocupar em aprender. Veja como não só é possível usar clean architecture no seu dia a dia no trabalho como também é uma ótima prática.",
         "speakers": [
             101
         ],
         "complexity": "Praticantes",
         "tags": [
             "Android"
         ]
     },
     "305": {
         "id": 305,
         "title": "Offline-first Progressive Web Apps",
         "description": "Abordar sobre offline-first em web apps desenvolvidas com Javascript.",
         "speakers": [
             201
         ],
         "complexity": "Profissionais",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "306": {
         "id": 306,
         "title": "Como deixar seu Back-end enxuto",
         "description": "O desenvolvimento do back-end de aplicações grandes pode ser muito caótico, ainda mais quando não se utiliza uma arquitetura escalável. O velho e conhecido MVC já é famoso por ser uma arquitetura simples de entender e que ajuda a manter o código mais organizado. Mas e quando o projeto começa a ficar muito grande o MVC começa a não ser mais suficiente para organizar tudo isso, vamos ver algumas técnicas (com Ruby on Rails) e práticas para evitar esse problema e deixar seu projeto mais escalável e organizado.",
         "speakers": [
             202
         ],
         "complexity": "Profissionais",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "307": {
         "id": 307,
         "title": "Dev who Designs",
         "description": "Existe um mito de que Design é tela bonita. Design é um processo complexo de imersão no problema a ser resolvido e um design bem feito soluciona algo. Desta forma Design não é necessariamente papel de um designer, mas Desenvolvedores podem ajudar a desenhar uma solução matadora de problemas. Veja na visão de um Designer e de um Desenvolvedor como isso pode ser feito em conjunto no dia-a-dia do nosso trabalho.",
         "speakers": [
             203,
             204
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "308": {
         "id": 308,
         "title": "Usando Gradle a seu favor",
         "description": "Entenda como funciona o Gradle em seu projeto Android e veja o que é possível de ser feito para tornar o seu dia a dia mais produtivo.",
         "speakers": [
             205
         ],
         "complexity": "Praticantes",
         "tags": [
             "Android",
             "Desenvolvimento"
         ]
     },
     "309": {
         "id": 309,
         "title": "Implementando chat real-time no Elo7",
         "description": "Descubra como utilizar JavaScript isomórfico em soluções de real-time.",
         "speakers": [
             102
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "310": {
         "id": 310,
         "title": "Competitive Programming: The Art of Programming Contest",
         "description": "Uma introdução sobre a programação competitiva, uma ferramenta de contratação de grandes empresas como IBM, Google e Facebook, através de competições como Google Code Jam e ACM ICPC.",
         "speakers": [
             206
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "311": {
         "id": 311,
         "title": " Spring Boot - Integrando Frameworks de forma fácil",
         "description": "Acelere o desenvolvimento Java Web com Spring Boot Framework. Veja como integrar de forma fácil diversos frameworks tais como JPA/hibernate, AssertJ, JSF, Lombok, Restful utilizando o Spring Boot Frameworks.",
         "speakers": [
             207
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "312": {
         "id": 312,
         "title": "Almoço",
         "description": "Comidaaaaa!",
         "image": "/images/backgrounds/lunch.jpg"
     },
     "313": {
         "id": 313,
         "title": "Scalando soluções com Akka",
         "description": "O modelo de atores tem ganhado muita atenção no desenvolvimento de sistemas distribuídos como uma alternativa ao uso de threads. Akka traz esse modelo para Java/Scala fornecendo um framework completo para o desenvolvimento de sistemas distribuídos resilientes, escaláveis e responsivos. Nesta palestra vamos mostrar o uso do Akka, suas APIs e projetos top-level.",
         "speakers": [
             208
         ],
         "complexity": "Profissionais",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "314": {
         "id": 314,
         "title": "Inteligência na tomada de decisão e agronegócio: um estudo de caso no setor da pecuária",
         "description": "Nesta palestra serão apresentados os principais conceitos de Business Intelligence ou inteligência nos negócios através de um estudo de caso no setor da agropecuária, por meio desse estudo de caso serão abordados conceitos como Data Warehouse e Data Mart, além da apresentação de todo um ecossistema de ferramentas open source escritas em JAVA que podem ser utilizadas no processo de análise e tomada de decisão de empresas privadas e orgãos públicos.",
         "speakers": [
             209
         ],
         "complexity": "Iniciantes",
         "tags": [
             "Desenvolvimento",
             "Gestão, Negócios e Agilidade"
         ]
     },
     "315": {
         "id": 315,
         "title": "Montando uma arquitetura web com JavaEE 7",
         "description": "Configuração e utilização de uma arquitetura básica para o desenvolvimento de um middleware Java voltado para web em uma perspectiva para iniciantes.",
         "speakers": [
             210
         ],
         "complexity": "Iniciantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "316": {
         "id": 316,
         "title": "Escalando o processamento de dados com Apache Kafka",
         "description": "Essa sessão apresentará as características do Apache Kafka e como utilizá-lo para construir um pipeline de processamento distribuído e escalável.",
         "speakers": [
             211
         ],
         "complexity": "Iniciantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "317": {
         "id": 317,
         "title": "Chatops na prática: Aumentando o desempenho de seu time",
         "description": "Muitos times gastam muito tempo com tarefas repetitivas e manuais sendo que poderiam automatizar várias delas para ganhar tempo e entregar mais valor ao cliente. Nessa sessão vamos conversar sobre o tema CHATOPS, e como ele pode ajudar os times no seu dia-a-dia.",
         "speakers": [
             212
         ],
         "complexity": "Iniciantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "318": {
         "id": 318,
         "title": "Desenvolvendo Web Apps com EmberJS",
         "description": "EmberJS é um poderoso framework para desenvolvimento de Web Apps. Vamos conhecer um pouco sobre o ele enquanto desenvolvemos um App para o Javaneiros!",
         "speakers": [
             213
         ],
         "complexity": "Praticantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "319": {
         "id": 319,
         "title": "Iniciando com Docker",
         "description": "Nesta palestra vamos ver como o docker pode nos ajudar a levantar um ambiente para testes e homologações de sistemas, de forma rápida e muito prática. Vamos aprender a montar um Dockerfile com base numa imagem oficial, realizar a build de um container e criar as nossas próprias images. E enviar para o docker hub. Como exemplo prático vamos montar um conjunto de 6 containers sendo um cluster de 3 servidor de aplicação (com replicação de sessão entre eles), um serviço de banco de dados (MySQL), um balanceador de carga (NGinx) e um acelerador de conteúdo HTTP (varnish-cache).",
         "speakers": [
             214
         ],
         "complexity": "Iniciantes",
         "tags": [
             "Desenvolvimento"
         ]
     },
     "320": {
         "id": 320,
         "title": "Mesa Redonda - Carreira",
         "description": "Vamos receber diversos profissionais com trajetórias de sucesso que irão dar dicas e discutir o que é necessário para ser tornar um excelente profissional de TI.",
         "speakers": [
             1
         ],
         "complexity": "Praticantes",
         "tags": [
             "Carreira"
         ]
     },
     "321": {
         "id": 321,
         "title": "Encerramento",
         "description": "Make sure you won't miss closing ceremony, all gifts from out sponsors and partners will find their owners during this session.",
         "image": "/images/backgrounds/closing-jvn.png"
     },
     "322": {
         "id": 322,
         "title": "Pós evento e Networking",
         "description": "Afterparty is a great time to have some fun and meet new people",
         "image": "/images/backgrounds/party.jpg"
     }
 }
